We are given two strings, A and B.

A shift on A consists of taking string A and moving the leftmost character to the rightmost position. For example, if A = 'abcde', then it will be 'bcdea' after one shift on A. Return True if and only if A can become B after some number of shifts on A.

Example 1:
#+begin_example
Input: A = 'abcde', B = 'cdeab'
Output: true
#+end_example

Example 2:
#+begin_example
Input: A = 'abcde', B = 'abced'
Output: false
#+end_example

#+begin_src java :classname RotateString :cmdline "-cp ." :exports both :results output
  class RotateString {
      public static void main(String[] args) {
          System.out.println("input: A = abcde, B = cdeab, output: " + solution("abcde", "cdeab"));
          System.out.println("input: A = abcde, B = abced, output: " + solution("abcde", "abced"));
      }

      static boolean solution(String a, String b) {
          return a.length() == b.length() && (a + a).contains(b);
      }
  }
#+end_src

#+RESULTS:
: input: A = abcde, B = cdeab, output: true
: input: A = abcde, B = abced, output: false
